### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_glue_catalog_database.database will be created
+   resource "aws_glue_catalog_database" "database" {
+       arn          = (known after apply)
+       catalog_id   = "007774094020"
+       id           = (known after apply)
+       location_uri = (known after apply)
+       name         = "abdo6-grupo-k-ci-deploy"

+       create_table_default_permission {
+           permissions = (known after apply)

+           principal {
+               data_lake_principal_identifier = (known after apply)
            }
        }
    }

  # aws_glue_crawler.crawler["ingest_json"] will be created
+   resource "aws_glue_crawler" "crawler" {
+       arn           = (known after apply)
+       database_name = "abdo6-grupo-k-ci-deploy"
+       id            = (known after apply)
+       name          = "ingest_json"
+       role          = (known after apply)
+       tags_all      = (known after apply)

+       s3_target {
+           path = "s3://abdo6-grupo-k-ci-deploy/ingest_json/"
        }
    }

  # aws_glue_crawler.crawler["raw_json"] will be created
+   resource "aws_glue_crawler" "crawler" {
+       arn           = (known after apply)
+       database_name = "abdo6-grupo-k-ci-deploy"
+       id            = (known after apply)
+       name          = "raw_json"
+       role          = (known after apply)
+       tags_all      = (known after apply)

+       s3_target {
+           path = "s3://abdo6-grupo-k-ci-deploy/raw_json/"
        }
    }

  # aws_glue_job.transform-to-parquet will be created
+   resource "aws_glue_job" "transform-to-parquet" {
+       arn               = (known after apply)
+       glue_version      = "3.0"
+       id                = (known after apply)
+       max_capacity      = (known after apply)
+       name              = "transform-to-parquet"
+       number_of_workers = 6
+       role_arn          = (known after apply)
+       tags_all          = (known after apply)
+       timeout           = (known after apply)
+       worker_type       = "G.1X"

+       command {
+           name            = "glueetl"
+           python_version  = (known after apply)
+           script_location = "s3://abdo6-grupo-k-ci-deploy/transform-to-parquet.py"
        }

+       execution_property {
+           max_concurrent_runs = (known after apply)
        }

+       notification_property {
+           notify_delay_after = (known after apply)
        }
    }

  # aws_iam_role.crawler-role["ingest_json"] will be created
+   resource "aws_iam_role" "crawler-role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "glue.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "crawler-role-ingest_json"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # aws_iam_role.crawler-role["raw_json"] will be created
+   resource "aws_iam_role" "crawler-role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "glue.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "crawler-role-raw_json"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # aws_iam_role_policy.crawler-role-policy["ingest_json"] will be created
+   resource "aws_iam_role_policy" "crawler-role-policy" {
+       id     = (known after apply)
+       name   = "crawler-role-policy"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "glue:*",
+                           "s3:GetBucketLocation",
+                           "s3:ListBucket",
+                           "s3:ListAllMyBuckets",
+                           "s3:GetBucketAcl",
+                           "ec2:DescribeVpcEndpoints",
+                           "ec2:DescribeRouteTables",
+                           "ec2:CreateNetworkInterface",
+                           "ec2:DeleteNetworkInterface",
+                           "ec2:DescribeNetworkInterfaces",
+                           "ec2:DescribeSecurityGroups",
+                           "ec2:DescribeSubnets",
+                           "ec2:DescribeVpcAttribute",
+                           "iam:ListRolePolicies",
+                           "iam:GetRole",
+                           "iam:GetRolePolicy",
+                           "cloudwatch:PutMetricData",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:CreateBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::aws-glue-*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:GetObject",
+                           "s3:PutObject",
+                           "s3:DeleteObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::aws-glue-*/*",
+                           "arn:aws:s3:::*/*aws-glue-*/*",
+                           "arn:aws:s3:::abdo6-grupo-k-ci-deploy/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:GetObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::crawler-public*",
+                           "arn:aws:s3:::aws-glue-*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "logs:CreateLogGroup",
+                           "logs:CreateLogStream",
+                           "logs:PutLogEvents",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:logs:*:*:/aws-glue/*",
                        ]
                    },
+                   {
+                       Action    = [
+                           "ec2:CreateTags",
+                           "ec2:DeleteTags",
                        ]
+                       Condition = {
+                           "ForAllValues:StringEquals" = {
+                               "aws:TagKeys" = [
+                                   "aws-glue-service-resource",
                                ]
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = [
+                           "arn:aws:ec2:*:*:network-interface/*",
+                           "arn:aws:ec2:*:*:security-group/*",
+                           "arn:aws:ec2:*:*:instance/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:GetObject",
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::abdo6-grupo-k-ci-deploy/ingest_json*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

  # aws_iam_role_policy.crawler-role-policy["raw_json"] will be created
+   resource "aws_iam_role_policy" "crawler-role-policy" {
+       id     = (known after apply)
+       name   = "crawler-role-policy"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "glue:*",
+                           "s3:GetBucketLocation",
+                           "s3:ListBucket",
+                           "s3:ListAllMyBuckets",
+                           "s3:GetBucketAcl",
+                           "ec2:DescribeVpcEndpoints",
+                           "ec2:DescribeRouteTables",
+                           "ec2:CreateNetworkInterface",
+                           "ec2:DeleteNetworkInterface",
+                           "ec2:DescribeNetworkInterfaces",
+                           "ec2:DescribeSecurityGroups",
+                           "ec2:DescribeSubnets",
+                           "ec2:DescribeVpcAttribute",
+                           "iam:ListRolePolicies",
+                           "iam:GetRole",
+                           "iam:GetRolePolicy",
+                           "cloudwatch:PutMetricData",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:CreateBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::aws-glue-*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:GetObject",
+                           "s3:PutObject",
+                           "s3:DeleteObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::aws-glue-*/*",
+                           "arn:aws:s3:::*/*aws-glue-*/*",
+                           "arn:aws:s3:::abdo6-grupo-k-ci-deploy/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:GetObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::crawler-public*",
+                           "arn:aws:s3:::aws-glue-*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "logs:CreateLogGroup",
+                           "logs:CreateLogStream",
+                           "logs:PutLogEvents",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:logs:*:*:/aws-glue/*",
                        ]
                    },
+                   {
+                       Action    = [
+                           "ec2:CreateTags",
+                           "ec2:DeleteTags",
                        ]
+                       Condition = {
+                           "ForAllValues:StringEquals" = {
+                               "aws:TagKeys" = [
+                                   "aws-glue-service-resource",
                                ]
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = [
+                           "arn:aws:ec2:*:*:network-interface/*",
+                           "arn:aws:ec2:*:*:security-group/*",
+                           "arn:aws:ec2:*:*:instance/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:GetObject",
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::abdo6-grupo-k-ci-deploy/raw_json*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```
</details>